xiaozhouyun/3519/empty.syscfg
/**
 * AI AGENTS: Do not edit this file directly. There is no validation or error feedback when
 * editing manually — mistakes will be silent until the file is loaded in SysConfig.
 * Use the SysConfig MCP server instead to make changes with immediate error reporting.
 *
 * These arguments were used when this file was generated. They will be automatically applied on subsequent loads
 * via the GUI or CLI. Run CLI with '--help' for additional information on how to override these arguments.
 * @cliArgs --device "MSPM0G351X" --part "Default" --package "LQFP-80(PN)" --product "mspm0_sdk@2.11.00.07"
 * @v2CliArgs --device "MSPM0G3519" --package "LQFP-80(PN)" --product "mspm0_sdk@2.11.00.07"
 * @versions {"tool":"1.28.0+4712"}
 */

/**
 * Import the modules used in this configuration.
 */
const ADC12  = scripting.addModule("/ti/driverlib/ADC12", {}, false);
const ADC121 = ADC12.addInstance();
const ADC122 = ADC12.addInstance();
const GPIO   = scripting.addModule("/ti/driverlib/GPIO", {}, false);
const GPIO1  = GPIO.addInstance();
const GPIO2  = GPIO.addInstance();
const GPIO3  = GPIO.addInstance();
const GPIO4  = GPIO.addInstance();
const GPIO5  = GPIO.addInstance();
const GPIO6  = GPIO.addInstance();
const GPIO7  = GPIO.addInstance();
const GPIO8  = GPIO.addInstance();
const I2C    = scripting.addModule("/ti/driverlib/I2C", {}, false);
const I2C1   = I2C.addInstance();
const PWM    = scripting.addModule("/ti/driverlib/PWM", {}, false);
const PWM1   = PWM.addInstance();
const PWM2   = PWM.addInstance();
const PWM3   = PWM.addInstance();
const QEI    = scripting.addModule("/ti/driverlib/QEI", {}, false);
const QEI1   = QEI.addInstance();
const QEI2   = QEI.addInstance();
const SPI    = scripting.addModule("/ti/driverlib/SPI", {}, false);
const SPI1   = SPI.addInstance();
const SPI2   = SPI.addInstance();
const SYSCTL = scripting.addModule("/ti/driverlib/SYSCTL");
const UART   = scripting.addModule("/ti/driverlib/UART", {}, false);
const UART1  = UART.addInstance();
const UART2  = UART.addInstance();

/**
 * Write custom configuration values to the imported modules.
 */
ADC121.$name                             = "xunji";
ADC121.sampClkDiv                        = "DL_ADC12_CLOCK_DIVIDE_4";
ADC121.peripheral.$assign                = "ADC1";
ADC121.peripheral.adcPin0.$assign        = "PA15";
ADC121.adcPin0Config.hideOutputInversion = scripting.forceWrite(false);
ADC121.adcPin0Config.$name               = "ti_driverlib_gpio_GPIOPinGeneric25";

ADC122.$name                             = "ADC12_0";
ADC122.peripheral.$assign                = "ADC0";
ADC122.peripheral.adcPin0.$assign        = "PA27";
ADC122.adcPin0Config.hideOutputInversion = scripting.forceWrite(false);
ADC122.adcPin0Config.$name               = "ti_driverlib_gpio_GPIOPinGeneric26";

const Board                       = scripting.addModule("/ti/driverlib/Board", {}, false);
Board.peripheral.$assign          = "DEBUGSS";
Board.peripheral.swclkPin.$assign = "PA20";
Board.peripheral.swdioPin.$assign = "PA19";

GPIO1.$name                                 = "TFT";
GPIO1.associatedPins.create(4);
GPIO1.associatedPins[0].assignedPort        = "PORTC";
GPIO1.associatedPins[0].assignedPin         = "8";
GPIO1.associatedPins[0].assignedPortSegment = "Lower";
GPIO1.associatedPins[0].initialValue        = "SET";
GPIO1.associatedPins[0].ioStructure         = "SD";
GPIO1.associatedPins[0].$name               = "TFT_DC";
GPIO1.associatedPins[1].assignedPort        = "PORTC";
GPIO1.associatedPins[1].assignedPin         = "9";
GPIO1.associatedPins[1].assignedPortSegment = "Lower";
GPIO1.associatedPins[1].ioStructure         = "SD";
GPIO1.associatedPins[1].initialValue        = "SET";
GPIO1.associatedPins[1].$name               = "TFT_CS";
GPIO1.associatedPins[2].assignedPort        = "PORTB";
GPIO1.associatedPins[2].assignedPin         = "23";
GPIO1.associatedPins[2].initialValue        = "SET";
GPIO1.associatedPins[2].ioStructure         = "SD";
GPIO1.associatedPins[2].$name               = "TFT_RES";
GPIO1.associatedPins[3].initialValue        = "SET";
GPIO1.associatedPins[3].ioStructure         = "SD";
GPIO1.associatedPins[3].assignedPort        = "PORTA";
GPIO1.associatedPins[3].assignedPin         = "30";
GPIO1.associatedPins[3].$name               = "TFT_BLK";

GPIO2.$name                          = "key";
GPIO2.associatedPins.create(4);
GPIO2.associatedPins[0].$name        = "key0";
GPIO2.associatedPins[0].direction    = "INPUT";
GPIO2.associatedPins[0].ioStructure  = "SD";
GPIO2.associatedPins[0].assignedPort = "PORTB";
GPIO2.associatedPins[0].assignedPin  = "29";
GPIO2.associatedPins[1].$name        = "key1";
GPIO2.associatedPins[1].direction    = "INPUT";
GPIO2.associatedPins[1].ioStructure  = "SD";
GPIO2.associatedPins[1].assignedPort = "PORTB";
GPIO2.associatedPins[1].assignedPin  = "30";
GPIO2.associatedPins[2].$name        = "key2";
GPIO2.associatedPins[2].direction    = "INPUT";
GPIO2.associatedPins[2].ioStructure  = "SD";
GPIO2.associatedPins[2].assignedPort = "PORTC";
GPIO2.associatedPins[2].assignedPin  = "6";
GPIO2.associatedPins[3].$name        = "key3";
GPIO2.associatedPins[3].direction    = "INPUT";
GPIO2.associatedPins[3].ioStructure  = "SD";
GPIO2.associatedPins[3].assignedPort = "PORTC";
GPIO2.associatedPins[3].assignedPin  = "7";

GPIO3.$name                          = "imuInt";
GPIO3.associatedPins[0].$name        = "int2";
GPIO3.associatedPins[0].direction    = "INPUT";
GPIO3.associatedPins[0].ioStructure  = "SD";
GPIO3.associatedPins[0].assignedPort = "PORTB";
GPIO3.associatedPins[0].assignedPin  = "24";

GPIO4.$name                          = "TB6612";
GPIO4.associatedPins.create(4);
GPIO4.associatedPins[0].$name        = "AIN2";
GPIO4.associatedPins[0].ioStructure  = "SD";
GPIO4.associatedPins[0].assignedPort = "PORTB";
GPIO4.associatedPins[0].assignedPin  = "22";
GPIO4.associatedPins[1].$name        = "AIN1";
GPIO4.associatedPins[1].ioStructure  = "SD";
GPIO4.associatedPins[1].assignedPort = "PORTB";
GPIO4.associatedPins[1].assignedPin  = "28";
GPIO4.associatedPins[2].$name        = "BIN1";
GPIO4.associatedPins[2].ioStructure  = "SD";
GPIO4.associatedPins[2].assignedPort = "PORTA";
GPIO4.associatedPins[2].assignedPin  = "24";
GPIO4.associatedPins[2].pin.$assign  = "PA24";
GPIO4.associatedPins[3].$name        = "BIN2";
GPIO4.associatedPins[3].assignedPort = "PORTA";
GPIO4.associatedPins[3].assignedPin  = "13";

GPIO5.$name                          = "dianci";
GPIO5.associatedPins.create(2);
GPIO5.associatedPins[0].ioStructure  = "SD";
GPIO5.associatedPins[0].$name        = "dian1";
GPIO5.associatedPins[0].assignedPin  = "27";
GPIO5.associatedPins[0].assignedPort = "PORTB";
GPIO5.associatedPins[0].pin.$assign  = "PB27";
GPIO5.associatedPins[1].$name        = "dian2";
GPIO5.associatedPins[1].assignedPort = "PORTB";
GPIO5.associatedPins[1].assignedPin  = "26";

GPIO6.$name                          = "buzzer";
GPIO6.associatedPins[0].$name        = "PIN_0";
GPIO6.associatedPins[0].ioStructure  = "SD";
GPIO6.associatedPins[0].assignedPort = "PORTB";
GPIO6.associatedPins[0].assignedPin  = "1";

GPIO7.$name                          = "DRV8873HPWPT";
GPIO7.associatedPins.create(2);
GPIO7.associatedPins[0].$name        = "PH1";
GPIO7.associatedPins[0].assignedPort = "PORTB";
GPIO7.associatedPins[0].ioStructure  = "SD";
GPIO7.associatedPins[0].assignedPin  = "17";
GPIO7.associatedPins[0].pin.$assign  = "PB17";
GPIO7.associatedPins[1].$name        = "PH2";
GPIO7.associatedPins[1].ioStructure  = "SD";
GPIO7.associatedPins[1].assignedPort = "PORTB";
GPIO7.associatedPins[1].assignedPin  = "18";

GPIO8.$name                          = "xunjiGPIO";
GPIO8.associatedPins.create(3);
GPIO8.associatedPins[0].$name        = "PIN_1";
GPIO8.associatedPins[0].assignedPort = "PORTA";
GPIO8.associatedPins[0].assignedPin  = "7";
GPIO8.associatedPins[0].ioStructure  = "SD";
GPIO8.associatedPins[1].$name        = "PIN_2";
GPIO8.associatedPins[1].ioStructure  = "SD";
GPIO8.associatedPins[1].assignedPort = "PORTA";
GPIO8.associatedPins[1].assignedPin  = "8";
GPIO8.associatedPins[2].$name        = "PIN_3";
GPIO8.associatedPins[2].assignedPort = "PORTA";
GPIO8.associatedPins[2].assignedPin  = "9";

