xiaozhouyun/3519/empty.syscfg
SYSCTL.BORThresh                      = "1";
SYSCTL.validateClkStatus              = true;
SYSCTL.SYSPLL_CLK0En                  = true;
SYSCTL.MCLKSource                     = "HSCLK";
SYSCTL.enableWorkaround_SYSPLL_ERR_01 = false;
SYSCTL.clockTreeEn                    = true;

UART1.targetBaudRate                   = 115200;
UART1.enableFIFO                       = true;
UART1.rxFifoThreshold                  = "DL_UART_RX_FIFO_LEVEL_ONE_ENTRY";
UART1.enableInternalLoopback           = false;
UART1.enableDMARX                      = false;
UART1.enableDMATX                      = false;
UART1.$name                            = "UART_1";
UART1.peripheral.$assign               = "UART1";
UART1.peripheral.rxPin.$assign         = "PB5";
UART1.peripheral.txPin.$assign         = "PB4";
UART1.txPinConfig.direction            = scripting.forceWrite("OUTPUT");
UART1.txPinConfig.hideOutputInversion  = scripting.forceWrite(false);
UART1.txPinConfig.onlyInternalResistor = scripting.forceWrite(false);
UART1.txPinConfig.passedPeripheralType = scripting.forceWrite("Digital");
UART1.txPinConfig.$name                = "ti_driverlib_gpio_GPIOPinGeneric5";
UART1.rxPinConfig.hideOutputInversion  = scripting.forceWrite(false);
UART1.rxPinConfig.onlyInternalResistor = scripting.forceWrite(false);
UART1.rxPinConfig.passedPeripheralType = scripting.forceWrite("Digital");
UART1.rxPinConfig.$name                = "ti_driverlib_gpio_GPIOPinGeneric6";

UART2.profile                          = "CONFIG_PROFILE_1";
UART2.enableInternalLoopback           = false;
UART2.$name                            = "UART_4";
UART2.peripheral.$assign               = "UART4";
UART2.peripheral.rxPin.$assign         = "PB11";
UART2.peripheral.txPin.$assign         = "PB10";
UART2.txPinConfig.direction            = scripting.forceWrite("OUTPUT");
UART2.txPinConfig.hideOutputInversion  = scripting.forceWrite(false);
UART2.txPinConfig.onlyInternalResistor = scripting.forceWrite(false);
UART2.txPinConfig.passedPeripheralType = scripting.forceWrite("Digital");
UART2.txPinConfig.$name                = "ti_driverlib_gpio_GPIOPinGeneric7";
UART2.rxPinConfig.hideOutputInversion  = scripting.forceWrite(false);
UART2.rxPinConfig.onlyInternalResistor = scripting.forceWrite(false);
UART2.rxPinConfig.passedPeripheralType = scripting.forceWrite("Digital");
UART2.rxPinConfig.$name                = "ti_driverlib_gpio_GPIOPinGeneric8";

const ProjectConfig              = scripting.addModule("/ti/project_config/ProjectConfig", {}, false);
ProjectConfig.migrationCondition = true;

/**
 * Pinmux solution for unlocked pins/peripherals. This ensures that minor changes to the automatic solver in a future
 * version of the tool will not impact the pinmux you originally saw.  These lines can be completely deleted in order to
 * re-solve from scratch.
 */
GPIO1.associatedPins[0].pin.$suggestSolution = "PC8";
GPIO1.associatedPins[1].pin.$suggestSolution = "PC9";
GPIO1.associatedPins[2].pin.$suggestSolution = "PB23";
GPIO1.associatedPins[3].pin.$suggestSolution = "PA30";
GPIO2.associatedPins[0].pin.$suggestSolution = "PB29";
GPIO2.associatedPins[1].pin.$suggestSolution = "PB30";
GPIO2.associatedPins[2].pin.$suggestSolution = "PC6";
GPIO2.associatedPins[3].pin.$suggestSolution = "PC7";
GPIO3.associatedPins[0].pin.$suggestSolution = "PB24";
GPIO4.associatedPins[0].pin.$suggestSolution = "PB22";
GPIO4.associatedPins[1].pin.$suggestSolution = "PB28";
GPIO4.associatedPins[3].pin.$suggestSolution = "PA13";
GPIO5.associatedPins[1].pin.$suggestSolution = "PB26";
GPIO6.associatedPins[0].pin.$suggestSolution = "PB1";
GPIO7.associatedPins[1].pin.$suggestSolution = "PB18";
GPIO8.associatedPins[0].pin.$suggestSolution = "PA7";
GPIO8.associatedPins[1].pin.$suggestSolution = "PA8";
GPIO8.associatedPins[2].pin.$suggestSolution = "PA9";
I2C1.peripheral.$suggestSolution             = "I2C0";
PWM2.peripheral.$suggestSolution             = "TIMG12";
QEI2.peripheral.$suggestSolution             = "TIMG9";
SPI1.peripheral.$suggestSolution             = "SPI0";
SPI1.peripheral.misoPin.$suggestSolution     = "PA10";
SPI2.peripheral.$suggestSolution             = "SPI1";
